# OLYMPIC DATA ANALYSIS

## IMPORT OLYMPIC DATAFRAME FOR ANALYSIS

In [32]:
import pandas as pd
o_df = pd.read_csv('olympics.csv', skiprows=4) # skiprows  is used to skip top 4 rows in csv which have unrelevant data

## DATA EXPLORATION WITH PANDAS TO UNDERSTAND WHAT THE DATAFRAME LOOKS LIKE

### HERE WE LOOK INTO MOST IMPORTANT FUNCTIONS USED FOR DATA EXPLORATION

In [33]:
o_df.head() # it gives the 5 rows of dataset

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [34]:
o_df.info() # provides the summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          29216 non-null  object
 1   Edition       29216 non-null  int64
 2   Sport         29216 non-null  object
 3   Discipline    29216 non-null  object
 4   Athlete       29216 non-null  object
 5   NOC           29216 non-null  object
 6   Gender        29216 non-null  object
 7   Event         29216 non-null  object
 8   Event_gender  29216 non-null  object
 9   Medal         29216 non-null  object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

In [35]:
o_df.describe() #gives summary statistics for numerical columns, including count, mean, standard deviation, minimum, and maximum values.

            Edition
count  29216.000000
mean    1967.713171
std       32.406293
min     1896.000000
25%     1948.000000
50%     1976.000000
75%     1996.000000
max     2008.000000

In [36]:
o_df.shape #returns the dimentions of the dataframe

(29216, 10)

In [37]:
o_df.dtypes #returns the data types of each columns

City            object
Edition          int64
Sport           object
Discipline      object
Athlete         object
NOC             object
Gender          object
Event           object
Event_gender    object
Medal           object
dtype: object

In [38]:
# Check if any column has null values
if o_df.isnull().any().any(): 
    #.isnull() creates a DataFrame of Boolean values where True represents a null value in the original DataFrame.
    #.any() is used twice to check for any null values. 
    # The first .any() checks if any column has at least one null value.
    # The second .any() checks if there is any True value in the result.
    print("There are columns with null values.")
else:
    print("No columns have null values.")

No columns have null values.

# ANALYSIS STARTS HERE WHERE WE TRY TO ANSWER SOME QUESTION

### 1. How has our china's overall medal count changed over the years?

In [39]:
#lets first look into the df
o_df.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
0,Athens,1896,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100m freestyle,M,Gold
1,Athens,1896,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100m freestyle,M,Silver
2,Athens,1896,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100m freestyle for sailors,M,Bronze
3,Athens,1896,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100m freestyle for sailors,M,Gold
4,Athens,1896,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100m freestyle for sailors,M,Silver

In [40]:
#now we set a df to china's data and we know that for that we can filter it with NOC column
#china's noc is CHN
china_data = o_df[o_df.NOC == 'CHN'] #here we have created a df of china only
#now to check the year's trend of of medals we need to further group the data using Edition column
medal_trend_chn = china_data.groupby('Edition')['Medal'].count()

#lets check if we have required result
medal_trend_chn

Edition
1984     76
1988     53
1992     83
1996    110
2000     79
2004     94
2008    184
Name: Medal, dtype: int64

In [41]:
o_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29216 entries, 0 to 29215
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   City          29216 non-null  object
 1   Edition       29216 non-null  int64
 2   Sport         29216 non-null  object
 3   Discipline    29216 non-null  object
 4   Athlete       29216 non-null  object
 5   NOC           29216 non-null  object
 6   Gender        29216 non-null  object
 7   Event         29216 non-null  object
 8   Event_gender  29216 non-null  object
 9   Medal         29216 non-null  object
dtypes: int64(1), object(9)
memory usage: 2.2+ MB

### 2. What are the most successful sports for our country in terms of medals?

In [42]:
china_data.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
16592,Los Angeles,1984,Aquatics,Diving,"LI, Kong-Zheng",CHN,Men,10m platform,M,Bronze
16596,Los Angeles,1984,Aquatics,Diving,"ZHOU, Ji-Hong",CHN,Women,10m platform,W,Gold
16600,Los Angeles,1984,Aquatics,Diving,"TAN, Liang-De",CHN,Men,3m springboard,M,Silver
16789,Los Angeles,1984,Archery,Archery,"LI, Ling-Juan",CHN,Women,individual FITA round,W,Silver
16914,Los Angeles,1984,Athletics,Athletics,"ZHU, Jian-Hua",CHN,Men,high jump,M,Bronze

In [43]:
#to find out the most successful sports in terms of medal we need to group by sport and count medals
mss = china_data.groupby('Sport')['Medal'].count()
mss

#top five most successful sports
mss.head()

Sport
Aquatics      118
Archery        15
Athletics      15
Badminton      47
Basketball     24
Name: Medal, dtype: int64

### 3. Find out the no of medals won by each gender

In [44]:
mwg = china_data.groupby('Gender')['Medal'].count()
mwg

Gender
Men      218
Women    461
Name: Medal, dtype: int64

### 4. Find out the gold silver and bronze medals won by each gender

In [45]:
emwg = china_data.groupby(['Gender', 'Medal'])['Medal'].count()
emwg
#if we need to group by further columns for example each sports, we can do the following
# china_data.groupby(['Gender', 'Medal', 'Sport'])['Medal'].count()

Gender  Medal
Men     Bronze     48
        Gold       95
        Silver     75
Women   Bronze    145
        Gold      139
        Silver    177
Name: Medal, dtype: int64

### 5. Who are the top-performing athletes from China in Olympic history?

In [46]:
china_data.head()

,City,Edition,Sport,Discipline,Athlete,NOC,Gender,Event,Event_gender,Medal
16592,Los Angeles,1984,Aquatics,Diving,"LI, Kong-Zheng",CHN,Men,10m platform,M,Bronze
16596,Los Angeles,1984,Aquatics,Diving,"ZHOU, Ji-Hong",CHN,Women,10m platform,W,Gold
16600,Los Angeles,1984,Aquatics,Diving,"TAN, Liang-De",CHN,Men,3m springboard,M,Silver
16789,Los Angeles,1984,Archery,Archery,"LI, Ling-Juan",CHN,Women,individual FITA round,W,Silver
16914,Los Angeles,1984,Athletics,Athletics,"ZHU, Jian-Hua",CHN,Men,high jump,M,Bronze

In [49]:
tpa = china_data.groupby('Athlete')['Medal'].count().sort_values(ascending=False)
tpa.head(10)

Athlete          Sport
WANG, Yifu       Shooting        6
LI, Ning         Gymnastics      6
LI, Xiaosahuang  Gymnastics      6
GUO, Jingjing    Aquatics        6
WANG, Nan        Table Tennis    5
FU, Mingxia      Aquatics        5
LOU, Yun         Gymnastics      5
LI, Xiaopeng     Gymnastics      5
XIONG, Ni        Aquatics        5
QIAO, Hong       Table Tennis    4
Name: Medal, dtype: int64

### 6. Which Olympic edition saw the highest medal count for China?

In [53]:
hmc = china_data.groupby('Edition')['Medal'].count().sort_values(ascending=False).head(1)
hmc

Edition
2008    184
Name: Medal, dtype: int64